In [5]:
#
# use the previous project code
# use max instead of a set to filter the taxids
# move up another parent of "no rank"
#

In [ ]:
# create new model.py file
# take user organism search
    # have an exception if organism not found
    # if no argument, ask for argument
# pair down to a single taxid
# work back through parents with while loop
# append to list, then print list in reverse
    # also print the children of the query?
# go all the way back to the root of taxid == 1

In [1]:
# 25.py
import sys

from model import *

if len(sys.argv) < 2:
    print("Input organism name")
    sys.exit(1)

init()

#query = sys.argv[1]
query = 'gorilla'

# search Name table
condition = Name.q.name.contains(query)

id_list = []
for n in Name.select(condition):
    id_list.append(n.taxonomy.taxid)

def most_frequent(List): 
    return max(set(List), key = List.count) 

#id_list = []
try:
    child = most_frequent(id_list)
    print(f'Best match taxID for query: {child}')
except ValueError:
    print(f"Organism name query {query} not found in database", file=sys.stderr)
    sys.exit(1)

#Get taxonomy row
t = Taxonomy.byTaxid(child)

r = t
lineage = []
while r.scientific_name != 'root':
    lineage.append(r)
    r = r.parent

print(f'Ascending lineage for: {lineage[0].scientific_name}')
print()

for i in lineage:
    print(f'{i.scientific_name} (TaxID: {i.taxid}) Rank: {i.rank}')

In [6]:
if g == None:
    print("Organism",t.scientific_name,"has no genus")
else:
    print("Organism",t.scientific_name,"has genus",g.scientific_name)

<Taxonomy 634 taxid=499232 scientific_name='Gorilla beringei' rank='species' parentID=128>
<Taxonomy 128 taxid=9592 scientific_name='Gorilla' rank='genus' parentID=462>
<Taxonomy 462 taxid=207598 scientific_name="'Homo/Pan/Gorilla...'" rank='no rank' parentID=139>
<Taxonomy 139 taxid=9604 scientific_name='Hominidae' rank='family' parentID=542>
<Taxonomy 542 taxid=314295 scientific_name='Hominoidea' rank='superfamily' parentID=75>
<Taxonomy 75 taxid=9526 scientific_name='Catarrhini' rank='parvorder' parentID=540>
<Taxonomy 540 taxid=314293 scientific_name='Simiiformes' rank='infraorder' parentID=581>
<Taxonomy 581 taxid=376913 scientific_name='Haplorrhini' rank='suborder' parentID=9>
<Taxonomy 9 taxid=9443 scientific_name='Primates' rank='order' parentID=539>
<Taxonomy 539 taxid=314146 scientific_name='Euarchontoglires' rank='superorder' parentID=8>
<Taxonomy 8 taxid=9347 scientific_name='Eutheria' rank='no rank' parentID=181>
<Taxonomy 181 taxid=32525 scientific_name='Theria' rank='no rank' parentID=230>
<Taxonomy 230 taxid=40674 scientific_name='Mammalia' rank='class' parentID=180>
<Taxonomy 180 taxid=32524 scientific_name='Amniota' rank='no rank' parentID=179>
<Taxonomy 179 taxid=32523 scientific_name='Tetrapoda' rank='no rank' parentID=7>
<Taxonomy 7 taxid=8287 scientific_name='Sarcopterygii' rank='no rank' parentID=351>
<Taxonomy 351 taxid=117571 scientific_name='Euteleostomi' rank='no rank' parentID=350>
<Taxonomy 350 taxid=117570 scientific_name='Teleostomi' rank='no rank' parentID=6>
<Taxonomy 6 taxid=7776 scientific_name='Gnathostomata' rank='superclass' parentID=5>
<Taxonomy 5 taxid=7742 scientific_name='Vertebrata' rank='no rank' parentID=319>
<Taxonomy 319 taxid=89593 scientific_name='Craniata' rank='subphylum' parentID=4>
<Taxonomy 4 taxid=7711 scientific_name='Chordata' rank='phylum' parentID=186>
<Taxonomy 186 taxid=33511 scientific_name='Deuterostomia' rank='no rank' parentID=185>
<Taxonomy 185 taxid=33316 scientific_name='Coelomata' rank='no rank' parentID=184>
<Taxonomy 184 taxid=33213 scientific_name='Bilateria' rank='no rank' parentID=3>
<Taxonomy 3 taxid=6072 scientific_name='Eumetazoa' rank='no rank' parentID=183>
<Taxonomy 183 taxid=33208 scientific_name='Metazoa' rank='kingdom' parentID=182>
<Taxonomy 182 taxid=33154 scientific_name="'Fungi/Metazoa gr...'" rank='no rank' parentID=2>
<Taxonomy 2 taxid=2759 scientific_name='Eukaryota' rank='superkingdom' parentID=393>
<Taxonomy 393 taxid=131567 scientific_name='cellular organisms' rank='no rank' parentID=1>
Organism Gorilla beringei has no genus

In [ ]:
# 24.py
from model import *
import sys

query = str(sys.argv[1])

condition = Name.q.name.contains(query)

id_set = set()
for n in Name.select(condition):
    id_set.add(n.taxID)

if len(id_set) == 0:
    print(f"Can't find query: {query}")
    sys.exit(1)

for i in id_set:
    sci_name = Taxonomy.get(i)
    print(f'{sci_name.scientificName} (taxid: {sci_name.id})')

In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("small_taxa.db3")
df1 = pd.read_sql_query("select * from name;", conn)

In [6]:
df1.head()

   id  taxonomy_id        name       name_class
0   1            1         all          synonym
1   2            1        root  scientific name
2   3            2     Eucarya          synonym
3   4            2  Eucaryotae          synonym
4   5            2     Eukarya          synonym

In [8]:
df1.shape

(1251, 4)

In [3]:
df2 = pd.read_sql_query("select * from taxonomy;", conn)

In [4]:
df2.head()

   id  taxid scientific_name          rank  parent_id
0   1      1            root       no rank          1
1   2   2759       Eukaryota  superkingdom        393
2   3   6072       Eumetazoa       no rank        183
3   4   7711        Chordata        phylum        186
4   5   7742      Vertebrata       no rank        319

In [9]:
df2.shape

(659, 5)